src/cf/Documents/_ДемоРеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>_ДемоРеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document._ДемоПоступлениеТоваров</xr:Item>
				<xr:Item>Document._ДемоСчетНаОплатуПокупателю</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister._ДемоОстаткиТоваровВМестахХранения</xr:Item>
				<xr:Item>AccumulationRegister.ПодарочныеСертификаты</xr:Item>
				<xr:Item>AccountingRegister._ДемоЖурналПроводокБухгалтерскогоУчета</xr:Item>
				<xr:Item>AccountingRegister._ДемоЖурналПроводокБухгалтерскогоУчетаБезКорреспонденции</xr:Item>
				<xr:Item>InformationRegister.ИсторияСтатусовПодарочныхСертификатов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоОрганизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоМестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._ДемоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоНоменклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПоступления</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._ДемоПоступлениеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючАналитики</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._ДемоКлючиАналитикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Добавил Шаравин Евгений 19.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СчетаНаОплату</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетНаОплату</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._ДемоСчетНаОплатуПокупателю</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОплатаПодарочнымиСертификатами</Name>
					<Comment>Добавил Шаравин Евгений 19.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Comment>Добавил Шаравин Евгений 19.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Comment>Добавил Шаравин Евгений 19.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/РеализацияПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 19.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПодарочныеСертификаты</xr:Item>
				<xr:Item>InformationRegister.ИсторияСтатусовПодарочныхСертификатов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодарочныеСертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ВводОстатковПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ВводОстатковПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПодарочныеСертификаты</xr:Item>
				<xr:Item>InformationRegister.ИсторияСтатусовПодарочныхСертификатов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПодарочныхСертификатов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокСуммы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодарочныеСертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыПодарочныхСертификатов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстатокСуммы</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетДо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ВозвратПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВозвратПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 19.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПодарочныеСертификаты</xr:Item>
				<xr:Item>InformationRegister.ИсторияСтатусовПодарочныхСертификатов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодарочныеСертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПодарочныйСертификат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonModules/ПодарочныеСертификатыКлиент/Ext/Module.bsl
Процедура ОбработатьПодборПодарочныхСертификатов(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатЗакрытия) = Тип("Массив") Тогда   
		ЭтоРеализацияТоваров = ДополнительныеПараметры.Форма.ИмяФормы = "Документ._ДемоРеализацияТоваров.Форма.ФормаДокумента";
		
		ОбъектФормы = ДополнительныеПараметры.Форма.Объект;
		ТабличнаяЧасть = ?(ЭтоРеализацияТоваров, ОбъектФормы.ОплатаПодарочнымиСертификатами, ОбъектФормы.ПодарочныеСертификаты);
		ИмяТабличнойЧасти = ?(ЭтоРеализацияТоваров, "ОплатаПодарочнымиСертификатами", "ПодарочныеСертификаты");
		ДатаСреза = ?(ОбъектФормы.Ссылка.Пустая(), КонецДня(ОбъектФормы.Дата), ОбъектФормы.Дата);
		           
		Для Каждого ПодарочныйСертификат Из РезультатЗакрытия Цикл
			СтрокиТабличнойЧасти = ТабличнаяЧасть.НайтиСтроки(Новый Структура("ПодарочныйСертификат", ПодарочныйСертификат));
			Если СтрокиТабличнойЧасти.Количество() = 0 Тогда
				НоваяСтрока = ТабличнаяЧасть.Добавить();
				НоваяСтрока.ПодарочныйСертификат = ПодарочныйСертификат;
				
				Если ДополнительныеПараметры.Форма.ИмяФормы = "Документ.РеализацияПодарочныхСертификатов.Форма.ФормаДокумента" Тогда
					
					НоваяСтрока.ДействуетДо = ПодарочныеСертификатыСервер.ПолучитьДатуОкончанияДействияСертификата(ПодарочныйСертификат, ОбъектФормы.Дата);
					
				ИначеЕсли ДополнительныеПараметры.Форма.ИмяФормы = "Документ.ВводОстатковПодарочныхСертификатов.Форма.ФормаДокумента" Тогда
					
					НоваяСтрока.Валюта = ПодарочныеСертификатыСервер.ПолучитьРеквизитыВидаПодарочныхСертификатов(ОбъектФормы.ВидПодарочныхСертификатов, "Валюта").Валюта;
					
				ИначеЕсли ЭтоРеализацияТоваров Тогда
					
					НоваяСтрока.СуммаОплаты = 0;
					
					Если ЗначениеЗаполнено(НоваяСтрока.ПодарочныйСертификат) Тогда
						ОстатокСтоимости = ПодарочныеСертификатыСервер.ПолучитьОстатокСтоимостиПоСертификату(НоваяСтрока.ПодарочныйСертификат, ДатаСреза);
						НоваяСтрока.СуммаОплаты = Макс(Мин(ОбъектФормы.Товары.Итог("Сумма") - ОбъектФормы.ОплатаПодарочнымиСертификатами.Итог("СуммаОплаты"), ОстатокСтоимости), 0);
						НоваяСтрока.Валюта = ОбъектФормы.Валюта;
					КонецЕсли;
					
				ИначеЕсли ДополнительныеПараметры.Форма.ИмяФормы = "Документ.ВозвратПодарочныхСертификатов.Форма.ФормаДокумента" Тогда
					
					Если ЗначениеЗаполнено(НоваяСтрока.ПодарочныйСертификат) Тогда
				        НоваяСтрока.НеиспользованныйОстатокСтоимости = ПодарочныеСертификатыСервер.ПолучитьОстатокСтоимостиПоСертификату(НоваяСтрока.ПодарочныйСертификат, ДатаСреза);
					Иначе
						НоваяСтрока.НеиспользованныйОстатокСтоимости = 0;
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон(НСтр("ru = 'Подарочный сертификат %1 уже добавлен в строке %2!'"), ПодарочныйСертификат, СтрокиТабличнойЧасти[0].НомерСтроки), , "Объект." + ИмяТабличнойЧасти + "[" + Формат(СтрокиТабличнойЧасти[0].НомерСтроки - 1, "ЧГ=") + "].ПодарочныйСертификат");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
